Tekla Open API Reference for Tekla Structures 2025
Part.GetDSTVCoordinateSystem Method
 Get DSTV coordinate system.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CoordinateSystem GetDSTVCoordinateSystem()
Public Function GetDSTVCoordinateSystem As CoordinateSystem
Return Value
Type: CoordinateSystem
The NC-DSTV coordinate system of the part on success, otherwise null.
See Also
Reference
Part Class
Tekla.Structures.Model Namespace